Конфигурация/Enums/СостоянияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СостоянияДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Записан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проведен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПомеченНаУдаление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/CommonModules/РаботаСоСпискомДокументовКлиент/Ext/Module.bsl
#Область КОМАНДЫ_ИЗМЕНЕНИЯ_СОСТОЯНИЯ_ДОКУМЕНТОВ

Процедура Провести(ДанныеДокументов) Экспорт

	Если ЕстьДокументПомеченныйНаУдаление(ДанныеДокументов) Тогда
		Предупреждение("Помеченный на удаление документ не может быть проведен!");
	КонецЕсли; 
	
	РаботаСоСпискомДокументов.ИзменитьСостояниеДокумента(ДанныеДокументов, РежимЗаписиДокумента.Проведение);

КонецПроцедуры // ПровестиГруппуДокументов

Процедура ОтменитьПроведение(ДанныеДокументов) Экспорт
	
	РаботаСоСпискомДокументов.ИзменитьСостояниеДокумента(ДанныеДокументов, РежимЗаписиДокумента.ОтменаПроведения);
	
КонецПроцедуры // ОтменитьПроведениеГруппыДокументов

Процедура УстановитьСнятьПометкуУдаления(ДанныеДокументов) Экспорт

	НовоеСостояниеДокументов = ?(ЕстьДокументПомеченныйНаУдаление(ДанныеДокументов),
		ПредопределенноеЗначение("Перечисление.СостоянияДокументов.Записан"),
			ПредопределенноеЗначение("Перечисление.СостоянияДокументов.ПомеченНаУдаление"));
	
	Если      НовоеСостояниеДокументов = ПредопределенноеЗначение("Перечисление.СостоянияДокументов.Записан") Тогда
		ТекстВопроса = ?(ДанныеДокументов.Количество() = 1, "Снять с """ + ДанныеДокументов[0].Документ + """ пометку на удаление?", "Снять с выделенных элементов пометку на удаление?");
	ИначеЕсли НовоеСостояниеДокументов = ПредопределенноеЗначение("Перечисление.СостоянияДокументов.ПомеченНаУдаление") Тогда
		ТекстВопроса = ?(ДанныеДокументов.Количество() = 1, "Пометить """ + ДанныеДокументов[0].Документ + """ на удаление?", "Пометить выделенные элементы на удаление?");
	КонецЕсли; 
	
	Если Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да) = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСоСпискомДокументов.ИзменитьСостояниеДокумента(ДанныеДокументов, РежимЗаписиДокумента.Запись, НовоеСостояниеДокументов);	
	
КонецПроцедуры // УстановитьСнятьПометкуУдаления

#КонецОбласти

&НаКлиенте
Процедура СоздатьНаОсновании(Документ, ВидОперацииЖурнала = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ВидОперацииЖурнала)
		И ТипЗнч(ВидОперацииЖурнала) = Тип("ПеречислениеСсылка.ВидыОперацийБэкОфиса") Тогда
		ВидДокумента = РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(ВидОперацииЖурнала);
	Иначе
		ВидДокумента = РаботаСДокументами.ПолучитьИмя(Документ);
	КонецЕсли;
		
	СписокДокументов = РаботаСМетаданнымиПовтИсп.ПолучитьСписокДокументовНаОсновании(ВидДокумента);
	
	Если СписокДокументов.Количество() = 0 Тогда
		Предупреждение("На основании данного документа документы не вводятся.");
		Возврат;
		
	ИначеЕсли СписокДокументов.Количество() = 1 Тогда
		ВидНовогоДокумента = СписокДокументов[0].Значение;
		
	Иначе
		
		ВидНовогоДокумента = ОткрытьФормуМодально("ОбщаяФорма.ВыборИзСпискаСФильтрацией", Новый Структура("Список, ТекущийЭлемент, Заголовок", СписокДокументов, ВидДокумента, "Документ"));
		
		Если ВидНовогоДокумента = Неопределено Или ВидНовогоДокумента = КодВозвратаДиалога.Отмена Тогда // Неопределено, если нажали ESC
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Открытьформу("Документ." + ВидНовогоДокумента + ".ФормаОбъекта", Новый Структура("Основание", Документ));
	
КонецПроцедуры // СоздатьНаОсновании

&НаКлиенте
Функция ЕстьДокументПомеченныйНаУдаление(ДанныеДокументов)
	
    Для каждого ДанныеДокумента Из ДанныеДокументов Цикл
		Если ДанныеДокумента.Состояние = ПредопределенноеЗначение("Перечисление.СостоянияДокументов.ПомеченНаУдаление") Тогда
			Возврат Истина;
		КонецЕсли; 
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции // ЕстьДокументПомеченныйНаУдаление
